import hemyProgress from '../src/main.js'

// const progress = new hemyProgress('#progress', {
//     type: "line",
//     percentage: 20,
//     strokeColor: ['green', 'blue', 'yellow', 'orange', 'red'],
//     borderRadius: 20,
// })


// setTimeout(() => {
//     progress.setProgress({ percentage: 80, isDashed: true })
// }, 1000)
// new hemyProgress('#progress', {
//     type: 'circle',
//     percentage: 50,
//     strokeWidth: 20,
//     backStrokeWidth: 20,
//     isDashed: true
// });
// new hemyProgress('#progress4', {
//     type: 'rect',
//     percentage: 50,
//     strokeColor: '#117A65',
//     backStrokeColor: '#A9CCE3',
//     strokeLinecap: 'round',
//     strokeLinejoin: 'round',
//     strokeWidth: 20,
//     backStrokeWidth: 20,
//     textStyle: { fontSize: '50px', color: 'green' }
// });

// new hemyProgress('#progress', {
//     type: 'line',
//     percentage: 50,
//     borderRadius: 20,
//     strokeColor: 'red',
//     slot: `
//         <div style="text-align:center">
//          <img src='js.png' style="width:20px;height:20px"></img>
//         </div>
//     `
// });
new hemyProgress('#progress', {
    type: 'circle',
    percentage: 50,
    strokeWidth: 20,
    backStrokeWidth: 20,
    radius: 60,
    strokeColor: '#641E16',
    strokeLinecap: 'round',
    slot: `
    <div style="text-align:center">
    <img src='lufei.png' style="width:100%;height:100%;border-radius:100%"></img>
   </div>
    `
});
// new hemyProgress('#progress3', {
//     type: 'path',
//     percentage: 50,
//     strokeWidth: 20,
//     backStrokeWidth: 20,
//     d: 'm33.67501,104.9269l68.53667,-70.58689l96.92669,0l68.53667,70.58689l0,99.8262l-68.53667,70.5869l-96.92669,0l-68.53667,-70.5869l0,-99.8262z',
//     slot: `
//         <p>这是自定义内容</p>
//     `
// });

// new hemyProgress('#progress', {
//     type: 'path',
//     percentage: 50,
//     showText: false,
//     strokeColor: 'red',
//     strokeWidth: 10,
//     strokeLinecap: 'round',
//     strokeLinejoin: 'round',
//     pathLength: 800,
//     d: 'm42.72,118.64947l83.26918,0l25.73082,-84.41472l25.73083,84.41472l83.26917,0l-67.36606,52.17057l25.73215,84.41472l-67.36609,-52.17199l-67.36607,52.17199l25.73216,-84.41472l-67.36608,-52.17057z'
// });
// new hemyProgress('#progress', {
//     type: 'path',
//     percentage: 50,
//     showText: false,
//     strokeWidth: 20,
//     backStrokeWidth: 20,
//     strokeLinecap: 'round',
//     strokeLinejoin: 'round',
//     strokeColor: 'blue',
//     pathLength: 800,
//     d: 'm20.74,153.83019l75.9583,-69.50019l0,34.75l110.08345,0l0,-34.75l75.95827,69.50019l-75.95827,69.49982l0,-34.74991l-110.08345,0l0,34.74991l-75.9583,-69.49982z'
// });
// new hemyProgress('#progress3', {
//     type: 'path',
//     percentage: 50,
//     showText: false,
//     strokeColor: 'green',
//     strokeLinecap: 'round',
//     strokeLinejoin: 'round',
//     pathLength: 800,
//     d: 'm79.41006,31.57006l-10.63746,0c0,0 -8.2736,-0.70702 -10.63746,8.48402c-4.2107,6.62803 -12.07794,3.7117 -14.18325,6.36297c-2.32697,0 -7.68263,1.23723 -7.09167,4.24192c0.59097,3.00478 2.36394,3.53499 1.7729,4.24201c-0.59097,0.70702 -2.21614,15.2005 13.29684,14.84699c0,0 1.62517,4.24192 8.86456,0c0,0 1.6251,-1.59074 4.4322,1.06043c2.80718,2.65127 8.42132,4.59552 9.75105,4.24201c1.32965,-0.35351 9.75097,16.79115 9.75097,41.35929c0,24.56824 11.37622,41.5361 15.06974,42.41991c0,0 8.97531,34.20096 9.30773,64.69021c0,0 2.21614,12.90274 -7.53483,12.72594c-5.26331,5.23622 -7.59028,8.81539 -4.43228,8.48402c0,0 1.2189,2.38602 3.54579,2.12096c1.00765,-0.43052 -8.14428,7.82118 -4.43228,7.42349c0,0 1.62525,5.65595 7.97807,2.12096c0,0 9.75105,1.06053 10.63746,-6.36297c0.88649,-7.42349 1.32973,-19.48659 5.31877,-18.02847c0,0 0.59089,-59.21097 5.31869,-63.62968c0,0 23.48477,2.31924 50.52791,-16.96795c7.68263,-5.47924 15.51291,-13.60975 16.84256,5.30244c1.32973,18.9122 25.11623,34.64291 28.36658,45.6013c3.25035,10.95849 5.02325,7.06999 4.4322,32.87537c0,0 -5.61413,-1.59074 -9.75097,4.24201c-2.65938,3.18148 0.88649,3.18148 0.88649,3.18148c0,0 -2.06842,2.47447 4.43228,2.12105c0,0 0.88641,1.19296 5.31869,0c0,0 7.38711,0.53022 6.20518,-6.36297c0,0 0.44324,-39.23843 2.65938,-37.11738c2.21614,2.12096 13.59229,14.49339 13.29677,41.35929c0,0 -5.02325,0.88372 -5.31869,7.42349c0,0 -2.51158,3.35819 0.88641,4.24201c0,0 4.76469,1.45812 6.20518,0c0,0 6.05753,2.47447 6.20518,-6.36306c0.14772,-8.83744 -4.87545,-39.5034 -2.65931,-46.66174c0,0 -19.05878,-13.25625 -22.1614,-54.08532c0,0 8.86456,34.64291 37.23114,28.63336c0,0 2.06842,-1.06043 -0.88649,-2.12096c-2.95491,-1.06053 -26.29816,2.65127 -31.91238,-31.81484c-4.09987,-24.6566 -0.99724,-27.30777 -14.18325,-37.11738c-17.72905,-20.28196 -61.90406,0.17671 -75.34854,-6.36297c-12.41036,-7.42349 -12.8536,-7.55603 -26.59361,-12.72594c-14.0725,-8.88171 -11.67159,-19.08891 -22.16133,-32.87537c-8.03353,-12.92478 -8.1258,-11.4887 -8.86456,-12.72594c-0.73877,-1.23733 -0.14772,-7.06999 -9.75097,-8.48402z'
// });



